SectionnerServer/Sectionner.GetCityAndLocations.res.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:ns="Sectionner">
 <SOAP-ENV:Body>
  <!-- ns__GetCityAndLocations(..., ns__AllCityLocatoins &responseCityLocation) -->
  <ns:AllCityLocatoins>
   <!-- std::vector<ns__CityLocation> aclCityLocatoins -->
   <aclCityLocatoins>
    <!-- std::string clCity -->
    <clCity></clCity>
    <!-- std::vector<std::string> clLocations -->
    <clLocations></clLocations>
    <clLocations></clLocations>
    <!-- ns__ErrorCode clErr -->
    <clErr>
     <!-- int eNo -->
     <eNo>0</eNo>
     <!-- std::string eMsg -->
     <eMsg></eMsg>
     <!-- enum ns__SettingLevel eType -->
     <eType>Normal</eType>
    </clErr>
   </aclCityLocatoins>
   <aclCityLocatoins>
    <!-- std::string clCity -->
    <clCity></clCity>
    <!-- std::vector<std::string> clLocations -->
    <clLocations></clLocations>
    <clLocations></clLocations>
    <!-- ns__ErrorCode clErr -->
    <clErr>
     <!-- int eNo -->
     <eNo>0</eNo>
     <!-- std::string eMsg -->
     <eMsg></eMsg>
     <!-- enum ns__SettingLevel eType -->
     <eType>Normal</eType>
    </clErr>
   </aclCityLocatoins>
   <!-- ns__ErrorCode aclErr -->
   <aclErr>
    <!-- int eNo -->
    <eNo>0</eNo>
    <!-- std::string eMsg -->
    <eMsg></eMsg>
    <!-- enum ns__SettingLevel eType -->
    <eType>Normal</eType>
   </aclErr>
  </ns:AllCityLocatoins>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
